Revit.Elements.SketchPlane
A Revit SketchPlane

Revit.Elements.SketchPlane.#ctor(Autodesk.Revit.DB.SketchPlane)
Set the Sketch plane from an existing one
existingSketchPlane:

Revit.Elements.SketchPlane.#ctor(Autodesk.Revit.DB.Plane)
Make a SketchPlane from a plane
p:

Revit.Elements.SketchPlane.InitSketchPlane(Autodesk.Revit.DB.SketchPlane)
Initialize a SketchPlane element
existingSketchPlane:

Revit.Elements.SketchPlane.InitSketchPlane(Autodesk.Revit.DB.Plane)
Initialize a SketchPlane element
p:

Revit.Elements.SketchPlane.InternalSetPlane(Autodesk.Revit.DB.Plane)
Attempt to set the plane of an existing SketchPlane
p:
Returns: False if the new sketch plane is not parallel to the existing one

Revit.Elements.SketchPlane.InternalSetSketchPlane(Autodesk.Revit.DB.SketchPlane)
Set the Element, ElementId, and UniqueId
existingSketchPlane:

Revit.Elements.SketchPlane.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Make a Revit SketchPlane given a plane
plane:
Returns:

Revit.Elements.SketchPlane.FromExisting(Autodesk.Revit.DB.SketchPlane,System.Boolean)
Create from an existing element
existingSketchPlane:
isRevitOwned:
Returns:

Revit.Elements.SketchPlane.InternalSketchPlane
Internal reference to the Revit Element

Revit.Elements.SketchPlane.InternalElement
Reference to the Element

Revit.Elements.SketchPlane.ElementPlaneReference
Get an element plane reference from a specified sketch plane

Revit.Elements.SketchPlane.Plane
Gets the plane geometry of the specified sketch plane